<?php 

    $questions = [
        [
            'question' => 'Яка найдовша річка України?',
            'answers' => ['Дніпро', 'Дунай', 'Дністер', 'Сіверський Донець'],
            'correct_answer' => 'Дніпро'
        ],
        [
            'question' => 'В якому році Україна здобула незалежність?',
            'answers' => ['1991', '1990', '1992', '1989'],
            'correct_answer' => '1991'
        ],
        [
            'question' => 'Який найвищий пік в Карпатах?',
            'answers' => ['Говерла', 'Петрос', 'Мармарош', 'Чорногора'],
            'correct_answer' => 'Говерла'
        ],
        [
            'question' => 'Яка тварина є символом Австралії?',
            'answers' => ['Кенгуру', 'Коала', 'Диявол тасманійський', 'Платпус'],
            'correct_answer' => 'Кенгуру'
        ],
        [
            'question' => 'Який хімічний елемент має символ H?',
            'answers' => ['Гідроген', 'Гелій', 'Оксиген', 'Нітроген'],
            'correct_answer' => 'Гідроген'
        ],
        [
            'question' => 'Який орган людини відповідає за вироблення інсуліну?',
            'answers' => ['Підшлункова залоза', 'Печінка', 'Нирки', 'Щитоподібна залоза'],
            'correct_answer' => 'Підшлункова залоза'
        ],
        [
            'question' => 'Хто написав Гамлета?',
            'answers' => ['Вільям Шекспір', 'Мігель де Сервантес', 'Фрідріх Шіллер', 'Жан-Жак Руссо'],
            'correct_answer' => 'Вільям Шекспір'
        ],
        [
            'question' => 'Який океан є найглибшим?',
            'answers' => ['Тихий океан', 'Атлантичний океан', 'Індійський океан', 'Північний Льодовитий океан'],
            'correct_answer' => 'Тихий океан'
        ],
        [
            'question' => 'Яка країна є найбільшою за площею?',
            'answers' => ['Росія', 'Канада', 'Китай', 'США'],
            'correct_answer' => 'Росія'
        ],
        [
            'question' => 'Хто відкрив Америку?',
            'answers' => ['Христофор Колумб', 'Васко да Гама', 'Марко Поло', 'Джеймс Кук'],
            'correct_answer' => 'Христофор Колумб'
        ],
        [
            'question' => 'Який хімічний елемент має символ Au?',
            'answers' => ['Золото', 'Срібло', 'Мідь', 'Платина'],
            'correct_answer' => 'Золото'
        ],
        [
            'question' => 'Яка тварина є найшвидшою на землі?',
            'answers' => ['Гепард', 'Лев', 'Вовк', 'Заєць'],
            'correct_answer' => 'Гепард'
        ]
    ];
    
    shuffle($questions);
    foreach ($questions as $key => $question) {
        shuffle($questions[$key]['answers']);
    }
    $questionsNum = 5;

    
    for ($i = 0; $i < $questionsNum; $i++) { 
        $questions2[] = $questions[$i];
    }
    
?>